app/admin/orders_admin.rb

      text_field :delivery_house_number
    end

    tab :products, badge: order.products&.size || 0 do
---
SELECT "products"."id" FROM "products" INNER JOIN "product_orders" ON "products"."id" = "product_orders"."product_id" WHERE "products"."deleted_at" IS NULL AND "product_orders"."order_id" = $1  [["order_id", 1]]